import { Component, OnInit } from '@angular/core';
import {Question} from '../../interfaces/question';

@Component({
  selector: 'app-service',
  templateUrl: './service.component.html',
  styleUrls: ['./service.component.scss']
})
export class ServiceComponent implements OnInit {

  constructor() { }

  pharmacy = '<p><span class="span-bold">হিসাব চিকিৎসক/ Accounting Doctor</span></p>\n' +
    '<p>অসুস্থতা প্রত্যেকটি মানুষের জীবনেই থাকে। আর ওষুধের জন্য দরকার পড়ে ফার্মেসির। আর তাই ফার্মেসি কেন্দ্রিক নগদ অর্থের লেনদেনও অনেক বেশি হয়ে থাকে। ৫০ পয়সা হোক কিংবা ৫০ টাকা- প্রতিটি ওষুধের হিসাব, দিন শেষে বিক্রির সংখ্যা, পরবর্তী সম্ভাব্য লাভজনক পণ্যের খোঁজ ইত্যাদি প্রয়োজন হয় প্রতিটি ফার্মেসিতেই।</p>\n' +
    '<p>তবে এই গোটা আর্থিক ব্যবস্থাপনাই ভেঙ্গে পড়তে পারে যদি হিসাবে গড়মিল দেখা দেয়। Cash management-এর মূল লক্ষ্যই হচ্ছে নগদ অর্থের সঠিক ব্যবস্থাপনার জন্য Accounting Doctor সেবাকে পুরো দেশে ছড়িয়ে দেওয়া। কী এই Accounting Doctor সেবা? ডক্টর বলেই যে এটি অসুখের চিকিৎসক তা নয়, Accounting Doctor সেবার মাধ্যমে আমরা আপনার ব্যবসার হিসাবকে সবল করে তুলবো, যাতে করে পরবর্তীতে আরো অনেকের মতো আপনার ফার্মেসিটিও সফলতার মুখ দেখতে পায়।</p>\n' +
    '<p>এক্ষেত্রে ছোট, মাঝারি ও বৃহৎ- যেকোনো আকৃতির ব্যবসায়িক কার্যক্রমের মালিকই আপনি হোন না কেন, আপনার ব্যবসার সার্বিক দিক বিচার বিশ্লেষণ করে যথাযথ কৌশল ও দিক নির্দেশনা প্রদান করবো আমরা। ব্যবসা সংক্রান্ত আর্থিক যেকোনো প্রয়োজনেই আপনি পাশে পাবেন Cash Management কে।</p>\n' +
    '<p><span class="span-bold">"সাফল্যের চ্যালেঞ্জ" নিতে কি প্রস্তুত !!!</span></p>\n' +
    '<p>“ফার্মেসির কাজে Cash Management কেন প্রয়োজন?” স্বাভাবিকভাবেই আপনার মনে এই প্রশ্নটি আসতে পারে। সহজভাবে উত্তর দিতে গেলে, ছোট কিংবা বড়, প্রতিটি ব্যবসায়িক কাজেই জড়িত থাকে Cash Management বা আর্থিক ব্যবস্থাপনা। ফার্মেসি অত্যন্ত লাভজনক এবং সচল একটি ব্যবসায়িক কার্যক্রম। তবে খুব ভালো কোন ব্যবসাতেও পরিকল্পনা ও আর্থিক ব্যবস্থাপনার অভাব থাকতে পারে। আর এই ছোট্ট কিছু কারণেই সচল ব্যবসা খুব দ্রুত অচল হয়ে পড়তে পারে। আর এজন্যই আপনার পাশে দাড়াতে চায় Cash Management।</p>\n' +
    '<p>খুব ছোট আর সুক্ষ খরচগুলোকেও আপনার সামনে হাজির করবো আমরা। যেকোনো আয় কিংবা ব্যয়- কোনটাই আপনার চোখকে ফাঁকি দিতে পারবে না। সাথে থাকবে ফার্মেসির খরচ কমানোর পরামর্শ, সম্ভাব্য বিনিয়োগের লাভজনক ক্ষেত্র সম্পর্কে তথ্য এবং সর্বোপরি অর্থ সঞ্চয় করা বা টাকা জমানোর প্রবণতা তৈরি। আপনি যত টাকাই আয় করুন না কেন, সঠিক বিনিয়োগ না করলে এবং না জমালে দিন শেষে আপনি কতটা ব্যবসা করলেন সেটি কোন গুরুত্বই রাখবে না।</p>\n' +
    '<p>সময় এসে গেছে এবার আপনারও Cash Management-এর সাথে হাত মিলিয়ে নিজের সঞ্চয়কে বাড়িয়ে তুলুন। একটি ফার্মেসির জায়গায় দুইটি ফার্মেসি পরিচালনার স্বপ্ন দেখুন। কারণ আমাদের সাথে পথ চললে এই স্বপ্ন বাস্তব হতে খুব বেশি সময় লাগবে না!\n' +
    '</p>\n' +
    '<p>তবে হ্যাঁ, প্রতিটি সেবা গ্রহণের কয়েকটি ধাপ থাকে। আপনি কি মাত্র একমাস আমাদের সেবাটি নেওয়ার কথা ভাবছেন? আপনার ফার্মেসিটি যেমন অনেকটা দিনের পরিশ্রমে গড়ে উঠেছে, তেমনি আমদের সেবাটিও কিছুটা সময় নেবে আপনার ব্যবসাকে বুঝতে। প্রতিটি ব্যবসা, প্রতিটি ফার্মেসিই ভিন্ন। আমাদের সেবা ও পরামর্শে আপনার চিরাচরিত ফার্মেসিকেই আরো বেশি লাভজনক করে তুলবে মাত্র ছয় মাসেই!</p>\n' +
    '<p>ভাবছেন, কথাগুলো বলার জন্যই বলা? একদম নয় ! Cash Management কথায় নয় কাজে বিশ্বাসী। তাই ইতিমধ্যেই দেশের বিভিন্ন প্রান্তে আমাদের সেবা গ্রহণ করে লাভের মুখ দেখেছেন এমন ফার্মেসি মালিকদের সন্তুষ্টি পেয়েছি আমরা। আপনি, হ্যাঁ আপনাকেই বলছি। আমাদের পরবর্তী সফল ব্যবসায়ীটি হয়তো আপনিই!</p>';
  SME = '<p>আপনার ফার্মেসিটি কি বড় নয় ? ছোট কিংবা মাঝারী ? আপনার ব্যবসা কি মুদি দোকান বা অন্যান্য পণ্য কেন্দ্রিক ? কোন চিন্তা নেই। শুধু ফার্মেসি নয়, আমাদের সেবা নিতে পারবেন ছোট ও মাঝারী সব ব্যবসায়ীরাই। হয়তো অর্থ, হয়তো সাহস কিংবা ধৈর্য্যের অভাবে এতদিন নিজের ছোট্ট ব্যবসাটাকে আরো বাড়িয়ে তোলা হয়নি আপনার। হয়তো কেউ এসে ব্যবসাকে আরো লাভজনক করে তোলার সুযোগ বা পথ আপনাকে বলে দেয়নি। কিন্তু Cash Management এসেছে আপনার কাছে। শুধু টিকে থাকাটাই নয়, আপনার ব্যবসাকে আরো অনেক বেশি বাড়িয়ে তোলাটাই আমাদের উদ্দেশ্যে। কী প্রয়োজন হবে এজন্য? আমাদের প্রয়োজন আপনার একটু ধৈর্য্য আর আমাদের উপরে বিশ্বাস। আমাদের পরামর্শ মেনে চলা হয়তো প্রাথমিকভাবে আপনার কাছে ঝামেলার মনে হতে পারে। তবে দিনশেষে ভালো খবরটা অপেক্ষা করবে আপনারই জন্য! </p>\n' +
    ' <p>কৌশলগত পরিকল্পনা যেকোনো সফলতার বড় একটি অংশ। আর আমরা এই পদ্ধতিই অনুসরণ করে চলি সবসময়। হুট করে সিদ্ধান্ত না নিয়ে আপনার জন্য সবগুলো দিক ভেবে কাজ পরিচালনা করি আমরা। তাই ব্যবসায়িক যেকোনো সিদ্ধান্তে আমাদের পরামর্শের সাথে আপনার হেরে যাওয়ার সম্ভাবনাও থাকবে অনেক কম। একইসাথে তৈরি হবে নতুন সব ব্যবসায়িক খাত !</p>\n' +
    ' <p><span class="span-bold">"সাফল্যের চ্যালেঞ্জ" নিতে কি প্রস্তুত !!!</span></p>\n' +
    ' <p>ব্যবসা মানেই ঝুঁকি। তবে এই ঝুঁকিই কমিয়ে আপনার জন্য আপনার হয়ে কাজ করবে Cash Management। সাধারণত SME-এর জন্য Cash Management অত্যন্ত গুরুত্বপূর্ণ একটি পদ্ধতি। আয় এবং ব্যয়ের সঠিক ভারসাম্য বজায় রাখার জন্য যেকোনো ব্যবসাতেই প্রয়োজন হয় অর্থ ব্যবস্থাপনা। ছোট ও মাঝারি ব্যবসাগুলো এর আওতার বাইরে নয়।</p>\n' +
    ' <p>আমরা Cash Management এর মাধ্যমে কী করি ? যেকোনো ব্যবসায়িক কার্যক্রমে কত খরচ হচ্ছে, কতটা আয় হচ্ছে, কোন কোন সিদ্ধান্ত নেওয়া হচ্ছে, কোথায় অর্থ লগ্নি করা হচ্ছে, কতটা সঞ্চয় হচ্ছে- এই সবকিছু যাচাই-বাছাই করার মাধ্যমে সঠিক পরামর্শ প্রদান করি আমরা। ব্যবসায় লাভ মানেই বেশি বিক্রি। তবে এই ছোট অথচ গুরুত্বপূর্ণ কাজগুলোই আপনার ব্যবসায় বিক্রিকে যথাযথভাবে নিয়ন্ত্রণ করে এবং লাভ এনে দেয়। ব্যবসায়িক লাভের এই মূল অংশটি নিয়েই কাজ করে থাকি আমরা।</p>\n' +
    ' <p>আমাদের প্রধান উদ্দেশ্যে থাকে আপনাকে লাভজন একটি পথ দেখানো। নতুন পথের পাশাপাশি পুরনো ব্যবসাকেও লাভজনক করে তোলা। আপনি মাল ক্রয় ও বিক্রয়ের জন্য আর্থিক লেনদেন করতেই পারেন। তবে এই নগদ টাকার প্রবাহ সেটি সঠিকভাবে চলছে কিনা তাও জানা থাকা প্রয়োজন।</p>\n' +
    ' <p>প্রাথমিকভাবে, বাজারকে সচল রাখার জন্য প্রয়োজন অর্থের। নগদ অর্থ এই অর্থের প্রকারভেদের মধ্যে সবচাইতে দরকারি ভূমিকা পালন করে থাকে। আপনি ব্যবসায়ী হয়ে থাকলে আপনার কাছেও নগদ অর্থ মানেই সেটা আবার বাজারে লগ্নি করে দেওয়াকেই বুদ্ধিমানের কাজ বলে মনে হবে। আপনি একদম ঠিক ভাবছেন। অর্থনীতির মূল প্রাণকেন্দ্রই এই অর্থ পরিচালনা। নগদ অর্থ প্রবাহ অর্থনীতিকে সচল করে তুলেছে সবসময়য়। তবে সেক্ষেত্রে একক ব্যবসায়ী হিসেবে আপনার নিজের লাভটুকুও দেখা প্রয়োজন। আর এই কাজটিই করে Cash Management। আপনি আপনার ব্যবসাকে অনেক ভালো জানেন, বোঝেন। তবে বর্তমান পৃথিবীতে যুগের সাথে তাল মিলিয়ে চলতে এখন আপনার প্রয়োজন Cash Management -কে!</p>';

  descriptions: Question[] = [
    {
      isLeft: true,
      title: 'ফার্মেসী - নগদ ব্যবস্থাপনা',
      img: '../../../assets/images/pharmacy.png',
      des: this.pharmacy,
      len: 351
    },
    {
      isLeft: false,
      title: 'সকল SME ব্যবসায়ীদের জন্য\n' +
        'Cash Mangement !',
      img: '../../../assets/images/SME.png',
      des: this.SME,
      len: 375
    },
  ];

  ngOnInit(): void {
  }

}
