import { Component, OnInit } from '@angular/core';
import { Comments } from 'src/app/interfaces/comments';

@Component({
  selector: 'app-comments',
  templateUrl: './comments.component.html',
  styleUrls: ['./comments.component.scss']
})
export class CommentsComponent implements OnInit {

  cards: Comments[] = [
    {
      img: '../../../assets/images/quotation-mark.png',
      des: 'দীর্য আট মাস ধরে এই সেবা নিতেছি, সেবাটি নিয়ে আমার ব্যবসায় আগের থেকে ভাল অবস্থায় আসছে। আগে কোম্পানীর কাছ থেকে যখন তখন মাল নিতাম, বেচা বিক্রি নিয়ে সারাক্ষন চিন্তা করতাম। বাকীর টাকা পাইতাম, কখনও পাইতাম না। দিন শেষে কোম্পানীর বিল দিতেও কষ্ট হইতো। এখন এসব কিছু থেকে আমি মুক্ত। আপনাদের সাফল্য কামনা করছি।',
      shop: 'জামিরা ফার্মেসী,',
      owner: 'জনাব, আব্দুর রশিদ',
      len: 242
    },
    {
      img: '../../../assets/images/quotation-mark.png',
      des: 'দীর্য পাঁচ মাস ধরে এই সেবা নিতেছি, সেবাটি নিয়ে আমার ব্যবসায় আগের থেকে ভাল অবস্থায় আসছে। আগে কোম্পানীর কাছ থেকে যখন তখন মাল নিতাম, বেচা বিক্রি নিয়ে সারাক্ষন চিন্তা করতাম। বাকীর টাকা পাইতাম, কখনও পাইতাম না। দিন শেষে কোম্পানীর বিল দিতেও কষ্ট হইতো। এখন এসব কিছু থেকে আমি মুক্ত। আপনাদের সাফল্য কামনা করছি।',
      shop: 'মা ফার্মেসী,',
      owner: 'জনাব, মামুন',
      len: 242
    },
    {
      img: '../../../assets/images/quotation-mark.png',
      des: 'দীর্য ছয় মাস ধরে এই সেবা নিতেছি, সেবাটি নিয়ে আমার ব্যবসায় আগের থেকে ভাল অবস্থায় আসছে। আপনাদের সাফল্য কামনা করছি।',
      shop: 'সেবা ফার্মেসী,',
      owner: 'জনাব, কবির',
      len: 242
    },
    {
      img: '../../../assets/images/quotation-mark.png',
      des: 'দীর্য আট মাস ধরে এই সেবা নিতেছি, সেবাটি নিয়ে আমার ব্যবসায় আগের থেকে ভাল অবস্থায় আসছে। আগে কোম্পানীর কাছ থেকে যখন তখন মাল নিতাম, বেচা বিক্রি নিয়ে সারাক্ষন চিন্তা করতাম। বাকীর টাকা পাইতাম, কখনও পাইতাম না। দিন শেষে কোম্পানীর বিল দিতেও কষ্ট হইতো। এখন এসব কিছু থেকে আমি মুক্ত। আপনাদের সাফল্য কামনা করছি।',
      shop: 'জামিরা ফার্মেসী,',
      owner: 'জনাব, আব্দুর রশিদ',
      len: 242
    },
    {
      img: '../../../assets/images/quotation-mark.png',
      des: 'দীর্য পাঁচ মাস ধরে এই সেবা নিতেছি, সেবাটি নিয়ে আমার ব্যবসায় আগের থেকে ভাল অবস্থায় আসছে। আগে কোম্পানীর কাছ থেকে যখন তখন মাল নিতাম, বেচা বিক্রি নিয়ে সারাক্ষন চিন্তা করতাম। বাকীর টাকা পাইতাম, কখনও পাইতাম না। দিন শেষে কোম্পানীর বিল দিতেও কষ্ট হইতো। এখন এসব কিছু থেকে আমি মুক্ত। আপনাদের সাফল্য কামনা করছি।',
      shop: 'মা ফার্মেসী,',
      owner: 'জনাব, মামুন',
      len: 242
    },
    {
      img: '../../../assets/images/quotation-mark.png',
      des: 'দীর্য ছয় মাস ধরে এই সেবা নিতেছি, সেবাটি নিয়ে আমার ব্যবসায় আগের থেকে ভাল অবস্থায় আসছে। আপনাদের সাফল্য কামনা করছি।',
      shop: 'সেবা ফার্মেসী,',
      owner: 'জনাব, কবির',
      len: 242
    },
  ];
  constructor() { }

  ngOnInit(): void {
  }

}
